# GetEntries Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntriesLoadContent..::..GetEntries Method
KeyBasedTreeEntriesLoadContent Class See Also
---
Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeyBasedTreeEntries GetEntries()
```

Visual Basic
---
```text
Public Function GetEntries As KeyBasedTreeEntries
```

Visual C++
---
```text
public:
KeyBasedTreeEntries^ GetEntries()
```

# ### Return Value
A copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is not built yet. The information about this KeyBasedTreeEntries object is not available. |

# See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace